export const hours = ['12a', '1a', '2a', '3a', '4a', '5a', '6a',
  '7a', '8a', '9a', '10a', '11a',
  '12p', '1p', '2p', '3p', '4p', '5p',
  '6p', '7p', '8p', '9p', '10p', '11p'
]
export const days = ['Saturday', 'Friday', 'Thursday',
  'Wednesday', 'Tuesday', 'Monday', 'Sunday'
]

export const hData = [
  [0, 0, 5],
  [0, 1, 1],
  [0, 2, 0],
  [0, 3, 0],
  [0, 4, 0],
  [0, 5, 0],
  [0, 6, 0],
  [0, 7, 0],
  [0, 8, 0],
  [0, 9, 0],
  [0, 10, 0],
  [0, 11, 2],
  [0, 12, 4],
  [0, 13, 1],
  [0, 14, 1],
  [0, 15, 3],
  [0, 16, 4],
  [0, 17, 6],
  [0, 18, 4],
  [0, 19, 4],
  [0, 20, 3],
  [0, 21, 3],
  [0, 22, 2],
  [0, 23, 5],
  [1, 0, 7],
  [1, 1, 0],
  [1, 2, 0],
  [1, 3, 0],
  [1, 4, 0],
  [1, 5, 0],
  [1, 6, 0],
  [1, 7, 0],
  [1, 8, 0],
  [1, 9, 0],
  [1, 10, 5],
  [1, 11, 2],
  [1, 12, 2],
  [1, 13, 6],
  [1, 14, 9],
  [1, 15, 11],
  [1, 16, 6],
  [1, 17, 7],
  [1, 18, 8],
  [1, 19, 12],
  [1, 20, 5],
  [1, 21, 5],
  [1, 22, 7],
  [1, 23, 2],
  [2, 0, 1],
  [2, 1, 1],
  [2, 2, 0],
  [2, 3, 0],
  [2, 4, 0],
  [2, 5, 0],
  [2, 6, 0],
  [2, 7, 0],
  [2, 8, 0],
  [2, 9, 0],
  [2, 10, 3],
  [2, 11, 2],
  [2, 12, 1],
  [2, 13, 9],
  [2, 14, 8],
  [2, 15, 10],
  [2, 16, 6],
  [2, 17, 5],
  [2, 18, 5],
  [2, 19, 5],
  [2, 20, 7],
  [2, 21, 4],
  [2, 22, 2],
  [2, 23, 4],
  [3, 0, 7],
  [3, 1, 3],
  [3, 2, 0],
  [3, 3, 0],
  [3, 4, 0],
  [3, 5, 0],
  [3, 6, 0],
  [3, 7, 0],
  [3, 8, 1],
  [3, 9, 0],
  [3, 10, 5],
  [3, 11, 4],
  [3, 12, 7],
  [3, 13, 14],
  [3, 14, 13],
  [3, 15, 12],
  [3, 16, 9],
  [3, 17, 5],
  [3, 18, 5],
  [3, 19, 10],
  [3, 20, 6],
  [3, 21, 4],
  [3, 22, 4],
  [3, 23, 1],
  [4, 0, 1],
  [4, 1, 3],
  [4, 2, 0],
  [4, 3, 0],
  [4, 4, 0],
  [4, 5, 1],
  [4, 6, 0],
  [4, 7, 0],
  [4, 8, 0],
  [4, 9, 2],
  [4, 10, 4],
  [4, 11, 4],
  [4, 12, 2],
  [4, 13, 4],
  [4, 14, 4],
  [4, 15, 14],
  [4, 16, 12],
  [4, 17, 1],
  [4, 18, 8],
  [4, 19, 5],
  [4, 20, 3],
  [4, 21, 7],
  [4, 22, 3],
  [4, 23, 0],
  [5, 0, 2],
  [5, 1, 1],
  [5, 2, 0],
  [5, 3, 3],
  [5, 4, 0],
  [5, 5, 0],
  [5, 6, 0],
  [5, 7, 0],
  [5, 8, 2],
  [5, 9, 0],
  [5, 10, 4],
  [5, 11, 1],
  [5, 12, 5],
  [5, 13, 10],
  [5, 14, 5],
  [5, 15, 7],
  [5, 16, 11],
  [5, 17, 6],
  [5, 18, 0],
  [5, 19, 5],
  [5, 20, 3],
  [5, 21, 4],
  [5, 22, 2],
  [5, 23, 0],
  [6, 0, 1],
  [6, 1, 0],
  [6, 2, 0],
  [6, 3, 0],
  [6, 4, 0],
  [6, 5, 0],
  [6, 6, 0],
  [6, 7, 0],
  [6, 8, 0],
  [6, 9, 0],
  [6, 10, 1],
  [6, 11, 0],
  [6, 12, 2],
  [6, 13, 1],
  [6, 14, 3],
  [6, 15, 4],
  [6, 16, 0],
  [6, 17, 0],
  [6, 18, 0],
  [6, 19, 0],
  [6, 20, 1],
  [6, 21, 2],
  [6, 22, 2],
  [6, 23, 6]
]

export const sunColor = ['#FFAE57', '#FF7853', '#EA5151', '#CC3F57', '#9A2555']
export const sunBgColor = '#2E2733'
export const sunStyle = {
  star5: {
    color: sunColor[0]
  },
  star4: {
    color: sunColor[1]
  },
  star3: {
    color: sunColor[2]
  },
  star2: {
    color: sunColor[3]
  }
}
export const sunData = [{
  name: '虚构',
  itemStyle: {
    normal: {
      color: sunColor[1]
    }
  },
  children: [{
    name: '小说',
    children: [{
      name: '5☆',
      children: [{
        name: '疼'
      }, {
        name: '慈悲'
      }, {
        name: '楼下的房客'
      }]
    }, {
      name: '4☆',
      children: [{
        name: '虚无的十字架'
      }, {
        name: '无声告白'
      }, {
        name: '童年的终结'
      }]
    }, {
      name: '3☆',
      children: [{
        name: '疯癫老人日记'
      }]
    }]
  }, {
    name: '其他',
    children: [{
      name: '5☆',
      children: [{
        name: '纳博科夫短篇小说全集'
      }]
    }, {
      name: '4☆',
      children: [{
        name: '安魂曲'
      }, {
        name: '人生拼图版'
      }]
    }, {
      name: '3☆',
      children: [{
        name: '比起爱你，我更需要你'
      }]
    }]
  }]
}, {
  name: '非虚构',
  itemStyle: {
    color: sunColor[2]
  },
  children: [{
    name: '设计',
    children: [{
      name: '5☆',
      children: [{
        name: '无界面交互'
      }]
    }, {
      name: '4☆',
      children: [{
        name: '数字绘图的光照与渲染技术'
      }, {
        name: '日本建筑解剖书'
      }]
    }, {
      name: '3☆',
      children: [{
        name: '奇幻世界艺术\n&RPG地图绘制讲座'
      }]
    }]
  }, {
    name: '社科',
    children: [{
      name: '5☆',
      children: [{
        name: '痛点'
      }]
    }, {
      name: '4☆',
      children: [{
        name: '卓有成效的管理者'
      }, {
        name: '进化'
      }, {
        name: '后物欲时代的来临'
      }]
    }, {
      name: '3☆',
      children: [{
        name: '疯癫与文明'
      }]
    }]
  }, {
    name: '心理',
    children: [{
      name: '5☆',
      children: [{
        name: '我们时代的神经症人格'
      }]
    }, {
      name: '4☆',
      children: [{
        name: '皮格马利翁效应'
      }, {
        name: '受伤的人'
      }]
    }, {
      name: '3☆'
    }, {
      name: '2☆',
      children: [{
        name: '迷恋'
      }]
    }]
  }, {
    name: '居家',
    children: [{
      name: '4☆',
      children: [{
        name: '把房子住成家'
      }, {
        name: '只过必要生活'
      }, {
        name: '北欧简约风格'
      }]
    }]
  }, {
    name: '绘本',
    children: [{
      name: '5☆',
      children: [{
        name: '设计诗'
      }]
    }, {
      name: '4☆',
      children: [{
        name: '假如生活糊弄了你'
      }, {
        name: '博物学家的神秘动物图鉴'
      }]
    }, {
      name: '3☆',
      children: [{
        name: '方向'
      }]
    }]
  }, {
    name: '哲学',
    children: [{
      name: '4☆',
      children: [{
        name: '人生的智慧'
      }]
    }]
  }, {
    name: '技术',
    children: [{
      name: '5☆',
      children: [{
        name: '代码整洁之道'
      }]
    }, {
      name: '4☆',
      children: [{
        name: 'Three.js 开发指南'
      }]
    }]
  }]
}]
